Repository: qngo9871-cmyk/ShogiDo
Catalog: ShogiDo/Localizable.xcstrings
Source language: en
Languages: ja

source: New Game
ja: 新規対局

source: Settings
ja: 設定

source: Resign
ja: 投了

source: You Win
ja: あなたの勝ちです

source: You Lose
ja: あなたの負けです

# Sente
source: Sente (Black)
ja: 先手

# Gote
source: Gote (White)
ja: 後手

source: Check!
ja: 王手！

# Promote?
source: Promote this piece?
ja: この駒を成りますか？

source: Promote
ja: 成る

source: Don't Promote
ja: 成らない

source: Home
ja: ホーム

source: Easy
ja: 初級

source: Normal
ja: 中級

source: Hard
ja: 上級

source: Unlock Pro
ja: Pro版を購入

source: Hand
ja: 持ち駒

source: Unlock Hard AI.
ja: 上級AIをアンロックします。

source: Restore Purchases
ja: 購入を復元

source: Maybe Later
ja: あとで

source: How to Play
ja: 遊び方

source: Let's Play
ja: はじめる

source: Done
ja: 完了

source: Moving a Piece
ja: 駒の動かし方

source: Tap one of your pieces to see its legal moves highlighted in green, then tap a highlighted square to move there.
ja: 自分の駒をタップすると合法手が緑色でハイライト表示されます。ハイライトされたマスをタップすると移動します。

source: Dropping a Piece
ja: 持ち駒を打つ

source: Captured enemy pieces join your hand, shown below the board. Tap a piece in your hand, then tap an empty square, to drop it back onto the board as your own.
ja: 取った相手の駒は盤の下に表示される持ち駒になります。持ち駒をタップしてから空きマスをタップすると、自分の駒として打つことができます。

source: Promotion
ja: 成り

source: Most pieces can flip to a stronger form when they move into, within, or out of the far three ranks. The app asks when promotion is optional, and promotes automatically when it's required.
ja: 多くの駒は、敵陣三段目に入る・その中で動く・そこから出るときに、より強い形へ成ることができます。成りが任意の場合はアプリが確認し、必須の場合は自動的に成ります。

source: Two Automatic Pawn Rules
ja: 歩に関する2つの自動判定

source: You can't drop a second unpromoted pawn on a file that already has one of your own (nifu), and you can't drop a pawn that delivers checkmate on the spot (uchifuzume). Both are enforced for you.
ja: 同じ筋に自分の成っていない歩がすでにある場合は打てません（二歩）。また、打った瞬間に詰みとなる歩打ちはできません（打ち歩詰め）。どちらも自動的に判定されます。
